#2_data_exploration

In [1]:
import pandas as pd
import seaborn as sns
import matplotlib
import matplotlib.pyplot as plt

# Загрузка данных
train_data = pd.read_csv('train.csv')
train_data.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,1,"Oconnor, Frankie",male,NaN,2,0,209245,27.14,C12239,S
1,1,0,3,"Bryan, Drew",male,NaN,0,0,27323,13.35,NaN,S
2,2,0,3,"Owens, Kenneth",male,0.33,1,2,CA 457703,71.29,NaN,S
3,3,0,3,"Kramer, James",male,19.00,0,0,A. 10866,13.04,NaN,S
4,4,1,3,"Bond, Michael",male,25.00,0,0,427635,7.76,NaN,S

# Data quality assessment

In [3]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 12 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   PassengerId  100000 non-null  int64
 1   Survived     100000 non-null  int64
 2   Pclass       100000 non-null  int64
 3   Name         100000 non-null  object
 4   Sex          100000 non-null  object
 5   Age          96708 non-null   float64
 6   SibSp        100000 non-null  int64
 7   Parch        100000 non-null  int64
 8   Ticket       95377 non-null   object
 9   Fare         99866 non-null   float64
 10  Cabin        32134 non-null   object
 11  Embarked     99750 non-null   object
dtypes: float64(2), int64(5), object(5)
memory usage: 9.2+ MB

In [8]:
#Удаление признаков с малым количеством данных
train_without = train_data.drop(['Cabin'], axis = 1)

In [16]:
#insert_cell - функция заполнение пропущенных данных
def insert_cell(df):
    df_copy = df.copy()
    
    #пропущщеные данные типа "object" заполняем самым частым значением в колонке
    objects = list(df_copy.select_dtypes(include=['object']).columns.values)
    for column in objects:
        if (df_copy[column].isnull().values.any()):
            df_copy[column].fillna(df_copy[column].mode()[0], inplace=True)

    #пропущщеные данные типа "float", "int" заполняем самым медианой в колонке
    float_int = list(df_copy.select_dtypes(include=['int64', 'float64']).columns.values)
    for column in float_int:
        if (df_copy[column].isnull().values.any()):
            df_copy[column].fillna(df_copy[column].median(), inplace=True)
    
    return df_copy

In [17]:
train_without = insert_cell(train_without)

In [18]:
train_without.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 11 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   PassengerId  100000 non-null  int64
 1   Survived     100000 non-null  int64
 2   Pclass       100000 non-null  int64
 3   Name         100000 non-null  object
 4   Sex          100000 non-null  object
 5   Age          100000 non-null  float64
 6   SibSp        100000 non-null  int64
 7   Parch        100000 non-null  int64
 8   Ticket       100000 non-null  object
 9   Fare         100000 non-null  float64
 10  Embarked     100000 non-null  object
dtypes: float64(2), int64(5), object(4)
memory usage: 8.4+ MB

# Summary